# gem install brewdler
# brewdle install
#
# brew search        # listing pkg
# brew cask search   # lisgint cask Application
# brew info          # インストールしたpkgの設定方法確認
# brew doctor
# brew options
# brew --config      # Homebrewの設定一覧
# brew --prefix pkg名 # Install path
# brew link
# brew unlink        # パッケージを一時的に無効化
# brew link          # パッケージを有効化
# cd `brew --prefix` # homebrewの保存先であるCellerディレクトリの場所に移動する
# brew tap           # (ex. brew tap homebrew/dupes => GitHubにある外部のFormulaセットを追加することが可能になる
# brew cleanup

tap  'homebrew/dupes'

brew 'macvim --with-cscope --with-lua --HEAD'
brew 'autoconf'
brew 'automake'
brew 'httpd'
brew 'bash'
brew 'colordiff'
brew 'bdw-gc'
brew 'bsdmake'
brew 'curl'          # ln -s `brew --prefix curl`/bin/curl /usr/local/bin
brew 'cmake'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'freetype'
#brew 'fuse4x'
brew 'haskell-platform'  # Install until the end, very time-consuming
#brew 'fuse4x-kext'
brew 'gdbm'
brew 'gettext'
brew 'glib'
brew 'gmp'
brew 'go'
brew 'graphicsmagick'
brew 'htop-osx'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'jpeg'
brew 'libevent'
brew 'libffi'
brew 'libpng'
brew 'libtool'
brew 'libyaml'
brew 'lua'
brew 'lv'
brew 'lynx'
brew 'mercurial'
brew 'multitail'
brew 'nkf'
brew 'nmap'
brew 'oniguruma'
brew 'openssl'
brew 'pidof'
brew 'pkg-config'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 's3cmd'
brew 'sqlite'
#brew 'sshfs'
brew 'tcpflow'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unixodbc'
brew 'w3m'
brew 'watch'
brew 'wget --enable-iri'
brew 'xz'
brew 'zlib'
brew 'zsh --disable-etcdir'

################
#  Git
################

brew 'git'
brew 'git-flow'
brew 'tig'

################
#  MySQL
################
brew 'mysql'


################
#  FONT
################
# tap  'sanemat/font'
# brew 'ricty'
# #cp -f /PATH/TO/RICTY/fonts/Ricty*.ttf ~/Library/Fonts/
# #fc-cache -vf


################
#  Cask
################
# - Homebrew-cask(Homebrewの拡張でWebから落としてきてインストールする様なソフトを 自動でインストール)
# - 「brew cask edit google-chrome」などで、オプション変更可能
# - ダウンロード可能アプリの一覧は「brew cask search」にて


# tap  'phinze/homebrew-cask'
# brew 'brew-cask'
# cask 'adobe-air'
# cask 'alfred link'
# cask 'alfred'
# cask 'app-cleaner'
# cask 'bartender'
# cask 'bettertouchtool'
# cask 'evernote'
# cask 'fluid'
# cask 'google-chrome'
# cask 'google-chrome-canary'
# cask 'google-web-designer'
# cask 'iterm2'
# cask 'livereload'
# cask 'marked2'
# cask 'path-finder'
# cask 'phpstorm'
# cask 'quick-cast'
# cask 'silverlight'
# cask 'vlc'
# #cask 'dropbox'
# #cask 'libre-office'
# #cask 'sequel-pro'
# #cask 'skype'
# #cask 'vagrant'
# #cask 'virtualbox'
# #cask 'x-quartz'




# 以下のApplicationは、Caskが無いので、手動でInstallする
# - Adobe CC
# - Adobe Flash Player
# - Elasticfox-ec2tag
# - ForkLift
# - Gyazo gif
# - Gyazo
# - GlyphDesigner
# - IAMFox
# - KeyRemap4MacBook
# - MS Office
# - MacVim-kaoriya
# - ParticleDesigner
# - R53Fox
# - Reflector
# - SplashtopStreamer
# - TotalFinder
# - Unity Web Player
# - cooviewer
# - Lingr
